logs/56e3c66d-3c78-4706-a6b1-26c3db8d3a30/07_BookingSave_RQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:BookingSave>
         <tem:strXml>
            <![CDATA[
            <Booking>
                <BookingHeader>
                    <contact_name>Madan Dhungana</contact_name>
                    <contact_email>madandhungana@gmail.com</contact_email>
                    <phone_mobile>9849665664</phone_mobile>
                    <phone_home></phone_home>
                    <phone_business></phone_business>
                </BookingHeader>
                
                <Passenger>
                    <passenger_id>0265c492-7fdb-4721-bd56-43ffabc763c7</passenger_id>
                    <passenger_type_rcd>ADULT</passenger_type_rcd>
                    <lastname>test</lastname>
                    <firstname>test</firstname>
                    <gender_type_rcd>M</gender_type_rcd>
                    <nationality_rcd>NP</nationality_rcd>
                    <date_of_birth>19950101</date_of_birth>
                </Passenger>
                <Payment>
                    <form_of_payment_rcd>CRAGT</form_of_payment_rcd>
                    <currency_rcd>NPR</currency_rcd>
                    <payment_amount>5050.0</payment_amount>
                </Payment>
            </Booking>
            ]]>
         </tem:strXml>
      </tem:BookingSave>
   </soapenv:Body>
</soapenv:Envelope>